tap 'homebrew/cask'

brew 'cmake'
brew 'htop'
brew 'jq'
brew 'fd'
brew 'ack'
brew 'wget'
brew 'fzf'
brew 'ctags'
brew 'neovim'
brew 'gpg'
brew 'diff-so-fancy'

#cask 'google-chrome'
cask 'rectangle'
cask 'kitty'
cask 'iterm2'

# node
brew 'node'
brew 'yarn'

# java
cask 'homebrew/cask-versions/zulu8'
cask 'homebrew/cask-versions/zulu11'
brew 'jenv'

# python
brew 'pyenv'
brew 'pyenv-virtualenv'

# scala
brew 'scala' 
brew 'sbt'

brew 'mas'
mas  'The Unarchiver', id: 425424353
# TODO: Add the other ones
cask 'spotify'
