brew 'cmake'
brew 'htop'
brew 'jq'
brew 'fd'
brew 'ack'
brew 'wget'
brew 'fzf'
brew 'ctags'
brew 'neovim'
brew 'gpg'
brew 'diff-so-fancy'

cask 'rectangle'
cask 'iterm2'

# node
brew 'node'
brew 'yarn'

# python
brew 'pyenv'
brew 'pyenv-virtualenv'

# dev
cask 'visual-studio-code'

cask 'alfred'
